Revit 2024 API
BuiltInFailures.MEPFabricationFailures.FabricationServiceMismatch Property
 Attempting to connect fabrication parts from different services.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId FabricationServiceMismatch { get; }
Visual Basic
Public Shared ReadOnly Property FabricationServiceMismatch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ FabricationServiceMismatch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MEPFabricationFailures Class
Autodesk.Revit.DB Namespace